export const singleLeadingJamos = [
    'ᄀ', 'ᄂ', 'ᄃ', 'ᄅ', 'ᄆ', 'ᄇ', 'ᄉ', 'ᄋ',
    'ᄌ', 'ᄎ', 'ᄏ', 'ᄐ', 'ᄑ', 'ᄒ', 'ᄼ', 'ᄾ',
    'ᅀ', 'ᅌ', 'ᅎ', 'ᅐ', 'ᅔ', 'ᅕ', 'ᅙ', 'ᅟ',
];

export const stackedLeadingJamos = [
    'ᄛ', 'ᄝ', 'ᄫ', 'ᄬ', 'ᅗ',
];

export const rightVowelJamos = [
    'ᅠ', 'ᅡ', 'ᅣ', 'ᅥ', 'ᅧ', 'ᅵ', 'ᆝ',
];

export const bottomVowelJamos = [
    'ᅩ', 'ᅭ', 'ᅮ', 'ᅲ', 'ᅳ', 'ᆞ', 'ᆢ',
];

export const mixedVowelJamos = [
    'ᅪ', 'ᅫ', 'ᅬ', 'ᅯ', 'ᅰ', 'ᅱ', 'ᅶ', 'ᅷ',
    'ᅸ', 'ᅹ', 'ᅺ', 'ᅻ', 'ᅼ', 'ᅽ', 'ᅾ', 'ᅿ',
    'ᆀ', 'ᆁ', 'ᆄ', 'ᆅ', 'ᆆ', 'ᆈ', 'ᆉ', 'ᆊ',
    'ᆋ', 'ᆌ', 'ᆎ', 'ᆏ', 'ᆐ', 'ᆑ', 'ᆒ', 'ᆔ',
    'ᆗ', 'ᆚ', 'ᆛ', 'ᆜ', 'ᆟ', 'ᆡ', 'ᆣ', 'ᆤ',
    'ᆦ', 'ᆧ', 'ힰ', 'ힲ', 'ힳ', 'ힴ', 'ힵ', 'ힶ',
    'ힷ', 'ힹ', 'ힺ', 'ힻ', 'ힽ', 'ퟁ', 'ퟂ', 'ퟃ',
    'ퟅ', 'ퟆ',
];
